//####################################################################
// DEPENDÊNCIAS:    Novo.Transferencia de Valor
// AUTOR:           Daniela Usuga
// Descrição:       Arquitectura inicial aplicación,  Json donde van los mensajes del aplicativo.
// DATA:            11/06/2019
//####################################################################

//tipo=0 éxito
//tipo=1 advertencia
//tipo=2 informacion
//tipo=3 pregunta
//tipo=4 error
//tipo=5 progreso
//tipo=6 cerrar sesión

{
  "Mensajes": [
    {
      "Codigo": 1,
      "Texto": "Se ha presentado un error. Por favor comunicarse con el administrador.",
      "Tipo": 4
    },
    {
      "Codigo": 2,
      "Texto": "Los nombres de los campos del archivo no coinciden con el formato definido, por favor revise la plantilla e intente de nuevo.",
      "Tipo": 2
    },
    {
      "Codigo": 3,
      "Texto": "La plantilla no se encuentra disponible, sin embargo puede realizar la carga con las columnas:Identificaión Selas ,Identificación Receptor, Tipo Identificación, Nombre Receptor, Código Municipio, Municipio Residencia, IdTipoReceptor, Tipo Receptor, Código Sociedad, Sociedad Científica, Especialidad, Identificación Reemplazante, Consentimiento Informado.",
      "Tipo": 2
    },
    {
      "Codigo": 4,
      "Texto": "El archivo no contiene información. Por favor validar",
      "Tipo": 2
    },
    {
      "Codigo": 6,
      "Texto": "Debe seleccionar un archivo con formato xls o xlsx",
      "Tipo": 2
    },
    {
      "Codigo": 5,
      "Texto": "La plantilla no se encuentra disponible, sin embargo puede realizar la carga con las columnas: Identificación receptor, Identificación Selas, Tipo alimento,ID Evento, Nombre evento, Fecha transferencia, Valor transferencia, Indicador Receptor, Tipo tercero, Eliminar. ",
      "Tipo": 2
    },
    {
      "Codigo": 7,
      "Texto": "¿Realmente desea eliminar registros?",
      "Tipo": 2
    },
    {
      "Codigo": 8,
      "Texto": "Se presentó un error al momento de guardar la Información.",
      "Tipo": 2
    },
    {
      "Codigo": 9,
      "Texto": "El archivo no contine registros válidos. Por favor verifique la información.",
      "Tipo": 2
    },
    {
      "Codigo": 10,
      "Texto": "La plantilla no se encuentra disponible, sin embargo puede realizar la carga con las columnas: Identificación receptor, Identificación Selas, Nit agencia, Id Evento, Nombre evento, Fecha transferencia, Valor tiquete,Valor alojamiento, Valor traslados, Valor tarjeta de asistencias, Valor por visa, Valor inscripción, Indicador Receptor, Tipo tercero, Eliminar.",
      "Tipo": 2
    },

    {
      "Codigo": 11,
      "Texto": "No se encontrarón coincidencias",
      "Tipo": 2
    },

    {
      "Codigo": 12,
      "Texto": "La plantilla no se encuentra disponible, sin embargo puede realizar la carga con las columnas: Identificación receptor,Identificación Selas, Fecha transferencia,Código Producto, Cantidad, Indicador Receptor, Tipo tercero, Eliminar.",
      "Tipo": 2
    },
    {
      "Codigo": 13,
      "Texto": "La plantilla no se encuentra disponible, sin embargo puede realizar la carga con las columnas: Identificación receptor, Identificación selas, Id evento, Nombre evento, Fecha transferencia, Valor transferencia, Indicador Receptor, Tipo tercero, Eliminar.",
      "Tipo": 2
    },
    {
      "Codigo": 14,
      "Texto": "La plantilla no se encuentra disponible, sin embargo puede realizar la carga con las columnas: Identificación receptor,Identificación Selas,Fecha transferencia, Valor transferencia,NroDocSAP, Indicador Receptor, Tipo tercero, Eliminar.",
      "Tipo": 2
    },
    {
      "Codigo": 17,
      "Texto": "La plantilla no se encuentra disponible, sin embargo puede realizar la carga con las columnas: Identificación receptor, Identificación Selas, Fecha transferencia, Valor transferencia, Contrato SAP, Indicador Receptor, Tipo tercero y Eliminar.",
      "Tipo": 2
    },
    {
      "Codigo": 18,
      "Texto": "La plantilla no se encuentra disponible, sin embargo puede realizar la carga con las columnas: Código SAP, Producto, IUM, CUM y Código SAP de reemplazo.",
      "Tipo": 2
    },
    {
      "Codigo": 18,
      "Texto": "La plantilla no se encuentra disponible, sin embargo puede realizar la carga con las columnas: Código SAP, Producto, IUM, CUM y Código SAP de reemplazo.",
      "Tipo": 2
    },
    {
      "Codigo": 19,
      "Texto": "La plantilla no se encuentra disponible, sin embargo puede realizar la carga con las columnas: Identificación receptor, Identificación Selas, Fecha transferencia, Valor transferencia, Indicador Receptor, Tipo tercero,NroDocSAP,Cod promomat,Material, Eliminar. ",
      "Tipo": 2
    },
    {
      "Codigo": 20,
      "Texto": "¿Realmente desea reemplazar los registros?",
      "Tipo": 2
    },
    {
      "Codigo": 21,
      "Texto": "El usuario no existe en la base de datos.",
      "Tipo": 2
    },
    {
      "Codigo": 22,
      "Texto": "El formato del mes de los gastos no concuerda con el estipulado(DD-YYYY)",
      "Tipo": 2
    }

  ]






  //"exclude",
  //[
  //  "**/bin",
  //  "**/bower_components",
  //  "**/jspm_packages",
  //  "**/node_modules",
  //  "**/obj",
  //  "**/platforms"
  //]
}
